package MainFrame.ChessMenuBar.ChessBar_Menus.Menu_Items.Help_MenuItems;

import javax.swing.*;
import java.awt.*;
import java.io.IOException;

public class HelpFrame extends JFrame {
    public HelpFrame() throws IOException {
        Runnable r = new Runnable () {
            public void run() {
                String pt1 = "<html><body width='";
                String pt2 =
                        "'><h1>Շախմատ</h1>" +
                                "<p> Շախմատ կամ Ճատրակ, երկու խաղացողի համար նախատեսված սեղանի խաղ, որը խաղում են հաջորդաբար բաց և մուգ գույնի 64 դաշտ ունեցող (8 x 8 վանդակ) քառակուսի խաղատախտակի վրա։" +
                                " Աշխարհում ամենատարածված խաղերից մեկն է․ միլիոնավոր մարդիկ շախմատ են խաղում տանը, հասարակական վայրերում, շախմատային ակումբներում, համակարգիչներով, առցանց, նամակագրությամբ և մրցաշարերում։" +
                                "Շախմատային պարտիայի (խաղի) սկզբում խաղացողներից յուրաքանչյուրը ունենում է 16 խաղաքար՝ մեկ արքա, մեկ թագուհի, երկու նավակ, երկու ձի, երկու փիղ և ութ զինվոր։ Ընդամենը վեց տեսակի խաղաքարերից յուրաքանչյուրը" +
                                " քայլում է յուրովի։ Խաղաքարերը օգտագործվում են հակառակորդի խաղաքարերը հարվածելու և վերցնելու համար, խաղի նպատակն է «մատ հայտարարել» հակառակորդի արքային,[1] այն է, «հարվածի տակ վերցնել» հակառակորդի արքային, այնպես," +
                                " որ հարվածից հնարավոր չլինի խուսափել։ Բացի մատ հայտարարելու դեպքից, խաղը համարվում է շահած, եթե." +
                                "    հակառակորդը ինքնակամ հանձնվել է, հակառակորդը սպառել է ժամանակը, հակառակորդը չի ներկայացել խաղին։ մինչև 1993 թվականը՝ եթե պարտիան հետաձգելիս հակառակորդը սխալ է գրանցել իր քայլը կամ գրանցել է կանոնների տեսակետից անթույլատրելի քայլ։" +
                                "Խաղը համարվում է ոչ-ոքի ավարտված, եթե. խաղատախտակի վրա պատ է (տվյալ խաղացողը չունի ոչ մի քայլ)," +
                                "    կողմերից մեկը հայտարարում է հավերժական շախ," +
                                "    դիրքը կրկնվում է երեք անգամ, եթե բոլոր դեպքերում քայլ պետք է կատարի նույն խաղացողը," +
                                "    հիսուն քայլի ընթացքում չի վերցվել ոչ մի ֆիգուր և ոչ մի զինվոր չի կատարել քայլ," +
                                "    կողմերի համաձայնությամբ (որոշ միցաշարերում այս դեպքը չի կիրառվում կամ կիրառվում է քայլերի սահմանափակմամբ, օրինակ՝ առաջին 30 քայլի ընթացքում համաձայնություն չի թույլատրվում)։<p>" +
                        " Տարբերում են խաղի 3 փուլ ՝սկզբնախաղ (երբեմն բացում), միջնախաղ և վերջնախաղ (երբեմն էնդշփիլ, գերմ.՝ Endspiel , թարգմանաբար՝ խաղի ավարտ)։" +
                                "Շախմատի աշխարհի չեմպիոնի տիտղոսին առաջինն արժանացել է Վիլհելմ Ստեյնիցը 1886 թվականին։ Ներկայիս Աշխարհի չեմպիոնն է Մագնուս Կառսլենը։"+
                                "Շախմատի աշխարհի առաջնությունից բացի անց են կացվում նաև Կանանց շախմատի աշխարհի առաջնություն, Պատանիների շախմատի աշխարհ առաջնություն, Մեծահասակների շախմատի աշխարհի առաջնություն, Նամակագրությամբ շախմատի աշխարհի առաջնություն, Շախմատի կայծակնային խաղի առաջնություն և Համակարգչային շախմատի աշխարհի առաջնություն։" +
                                "Շախմատային օլիմպիադան տարբեր երկրների թիմերի միջև մրցություն է, մեկ այլ թիմային մրցություն է Շախմատի աշխարհի թիմային առաջնությունը։ Առցանց շախմատը սիրողական և պրոֆեսիոնալ մրցությունները հասանելի դարձրեց խաղացողների լայն շերտերին:";

                JPanel p = new JPanel (new BorderLayout ());
                setIconImage (new ImageIcon ("C:\\Users\\Admin\\Desktop\\HTML\\Corel\\89(22).jpg").getImage ());
                setSize (500,500);
                setLocationRelativeTo (null);
                setTitle ("Խաղի մասին");
                int width = 500;
                String s = pt1 + width + pt2 + width ;

                JOptionPane.showMessageDialog (null,s);
            }
        };
        SwingUtilities.invokeLater (r);
    }
}
